aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/include/cy_sar.h
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_INTR_MASK(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_GetFifoInterruptStatusMasked
****************************************************************************//**
*
* Return the bitwise AND between the interrupt request and mask registers.
* See \ref Cy_SAR_GetFifoInterruptStatus and \ref Cy_SAR_GetFifoInterruptMask.
*
* \param base
* Pointer to structure describing registers
*
* \return
* Bitwise AND of the interrupt request and mask registers \ref group_sar_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR_GetFifoInterruptStatusMasked(const SAR_Type * base)
{
    uint32_t retVal = 0UL;

    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_INTR_MASKED(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_FifoSetLevel
****************************************************************************//**
*
* Sets the FIFO trigger level which specifies how many samples FIFO should
* contain in order to generate trigger event.
*
* \param base
* Pointer to structure describing registers
*
* \param level The FIFO trigger level to be set. Range: 1..256.
*
* \return None
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_FifoSetLevel(const SAR_Type *base, uint32_t level)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        uint32_t locLevel = level - 1UL; /* Convert the user value into the machine value */
        CY_ASSERT_L2(CY_SAR_IS_FIFO_LEVEL_VALID(level));
        PASS_FIFO_LEVEL(base) = _VAL2FLD(PASS_FIFO_V2_LEVEL_LEVEL, locLevel);
    }
}

/** \} */

/*******************************************************************************
* Function Name: Cy_SAR_SimultStart
****************************************************************************//**
*
* Simultaneously starts two or more SARs.
*
* \param base
* Pointer to structure describing PASS registers.
*
* \param sarMask specifies which SAR instances will be started.
* Mask should contain at least two SAR instances for operation.
*
* \param mode specifies mode of SARs operation.
*
* \return None
*
* \funcusage
* \snippet sar/snippet/main.c SAR_SNIPPET_SIMULT_START_STOP
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SimultStart(PASS_Type *base, uint32_t sarMask, cy_en_sar_start_convert_sel_t mode)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* SAR simultaneous start feature is not supported on PASS_ver1 IP block. */

    if (!CY_PASS_V1)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Deviate Pointer type conversions');
        PASS_SAR_SIMULT_FW_START_CTRL(base) =
            (_VAL2FLD(PASS_V2_SAR_SIMULT_FW_START_CTRL_FW_TRIGGER, sarMask) |
            ((mode == CY_SAR_START_CONVERT_CONTINUOUS) ? _VAL2FLD(PASS_V2_SAR_SIMULT_FW_START_CTRL_CONTINUOUS, sarMask) : 0UL));
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_SimultStop
****************************************************************************//**
*
* Stops the selected SARs.
*
* \param base
* Pointer to structure describing PASS registers.
*
* \param sarMask specifies which SAR instances should be stopped.
*
* \return None
*
* \funcusage
* \snippet sar/snippet/main.c SAR_SNIPPET_SIMULT_START_STOP
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SimultStop(PASS_Type *base, uint32_t sarMask)
{
    if (!CY_PASS_V1)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Deviate Pointer type conversions');
        PASS_SAR_SIMULT_FW_START_CTRL(base) = _VAL2FLD(PASS_V2_SAR_SIMULT_FW_START_CTRL_CONTINUOUS, (~sarMask));
    }
}

/** \} group_sar_functions */
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40PASS_SAR */

#endif /** !defined(CY_SAR_H) */

/** \} group_sar */

/* [] END OF FILE */
